persons/oleg-kiselyov/oleg-kiselyov.org
#+title: oleg kiselyov

* Typed Tagless Final Interpreters

  - x -
    instead of using algebraic data type
    to encode (initial encoding) target language's expression,

    to use native language's type system and type class
    to encode (finial encoding) target language's expression.

    - where "tagless" means no runtime overhead

    - where initial and finial are dual to each other
      in the sense of category theory.
