out/person/oleg-kiselyov/oleg-kiselyov.org.html
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>person/oleg-kiselyov/oleg-kiselyov.org</title>
</head>
<body>
<pre>#+title: oleg kiselyov

* Typed Tagless Final Interpreters

  - x -
    instead of using algebraic data type
    to encode (initial encoding) target language&apos;s expression,

    to use native language&apos;s type system and type class
    to encode (finial encoding) target language&apos;s expression.

    - where &quot;tagless&quot; means no runtime overhead

    - where initial and finial are dual to each other
      in the sense of category theory.
</pre>
</body>
</html>
